## 데이터 로드

In [1]:
import pandas as pd

naver_yg = pd.read_csv('../../../data/Naver/naver_yg.csv')

In [2]:
naver_yg.head()

       period     ratio title
0  2023-01-01  22.03788    YG
1  2023-01-02  14.55852    YG
2  2023-01-03   9.54832    YG
3  2023-01-04   7.11607    YG
4  2023-01-05   5.58135    YG

## period 변수 변환
- datetime 형식으로 변환 
- 변수명 'date'로 변경

In [3]:
# 변수명 변경
naver_yg.rename(columns={'period': 'date'}, inplace=True)

# 변수 형식 변경
naver_yg['date'] = pd.to_datetime(naver_yg['date'])
naver_yg.head() # 확인

        date     ratio title
0 2023-01-01  22.03788    YG
1 2023-01-02  14.55852    YG
2 2023-01-03   9.54832    YG
3 2023-01-04   7.11607    YG
4 2023-01-05   5.58135    YG

## title 변수에 따라 데이터프레임 분할

- 이 검색량 데이터의 그룹은 5개이다. 
- 'YG', 'BLACK PINK', 'TREASURE', 'GD', 'WINNER'

In [4]:
naver_yg['title'].unique()

array(['YG', 'BLACK PINK', 'TREASURE', 'GD', 'WINNER'], dtype=object)

In [5]:
df1 = naver_yg[naver_yg['title'] == 'YG']
df2 = naver_yg[naver_yg['title'] == 'BLACK PINK']
df3 = naver_yg[naver_yg['title'] == 'TREASURE']
df4 = naver_yg[naver_yg['title'] == 'GD']
df5 = naver_yg[naver_yg['title'] == 'WINNER']

In [6]:
df1.head()

        date     ratio title
0 2023-01-01  22.03788    YG
1 2023-01-02  14.55852    YG
2 2023-01-03   9.54832    YG
3 2023-01-04   7.11607    YG
4 2023-01-05   5.58135    YG

In [7]:
df2.head()

          date     ratio       title
181 2023-01-01  29.81641  BLACK PINK
182 2023-01-02  29.53666  BLACK PINK
183 2023-01-03  36.88780  BLACK PINK
184 2023-01-04  32.52841  BLACK PINK
185 2023-01-05  33.15201  BLACK PINK

In [8]:
# 인덱스를 0부터 시작하는 정수로 리셋
df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)
df3.reset_index(drop=True, inplace=True)
df4.reset_index(drop=True, inplace=True)
df5.reset_index(drop=True, inplace=True)

## 날짜별 검색량 총합 구하기

In [9]:
merged_df = pd.DataFrame()

In [10]:
merged_df['date'] = df1['date']

In [11]:
merged_df['ratio_sum'] = df1['ratio']+df2['ratio']+df3['ratio']+df4['ratio']+df5['ratio']

In [12]:
merged_df

          date  ratio_sum
0   2023-01-01   69.27633
1   2023-01-02   60.21755
2   2023-01-03   60.65854
3   2023-01-04   53.81251
4   2023-01-05   51.66778
..         ...        ...
176 2023-06-26   37.59493
177 2023-06-27   36.76734
178 2023-06-28   37.15977
179 2023-06-29   38.06506
180 2023-06-30   34.39338

[181 rows x 2 columns]

In [13]:
# csv 파일로 저장 
merged_df.to_csv('../../../data/Naver/naver_preprocessed_yg.csv',index = False)